import ASRMapper
from datetime import datetime


# r = ["景轩双手捧着一枚玉佩",
#      "极为郑重地向她的说",
#      "姑娘救命之恩",
#      "景轩无以为报",
#      "此乃我族性物",
#      "日后若有差遣",
#      "万死不辞"]
# c = ["引离金雕细琢的面旁","缓缓冷冽地说","擅闯无妄渊者","死"]

segments_alignment = [{'value': '<unk><unk>蛇妖與狐仙楊明正想詢問美女老師', 'start': 0, 'end': 6.67}, {'value': '是不是哪裏誤會瞭結果話音未落門口已經響起塗山靜如', 'start': 6.67, 'end': 12.13}, {'value': '仙子一般的清叱:兀那蛇妖還不趕緊放開我相公否則定讓', 'start': 12.13, 'end': 19.200001}, {'value': '你碎屍萬段死無葬身之地蛇妖楊明身子一抖震驚的看瞭', 'start': 19.200001, 'end': 27.530001}, {'value': '看白珍珍絕美的容顔心中竟有些輕鬆瞭起來但那種發自', 'start': 27.530001, 'end': 32.869999}, {'value': '骨子裏的熟悉感又再次襲瞭上來蛇妖一條通體雪白長近二', 'start': 32.869999, 'end': 39.880001}, {'value': '十米的巨大白蛇的形象突然從他腦海深處蹦瞭齣來突兀的', 'start': 39.880001, 'end': 45.68}, {'value': '是他竟然絲毫不會感到害怕甚至還覺得非常的親切官人', 'start': 45.68, 'end': 53.119999}, {'value': '小心對頭好生厲害到瞭門口我竟然都沒有察覺白珍珍突然', 'start': 53.119999, 'end': 60.790001}, {'value': '站瞭起來將楊明從幻象中拉瞭迴來她第一時間將楊明護在', 'start': 60.790001, 'end': 65.690002}, {'value': '瞭身後小心翼翼的戒備著道官人想不到我還是太冒失瞭本', 'start': 65.690002, 'end': 71.809998}, {'value': '以為經過韆年如今人道早就沒瞭什麼強大的修士想不到', 'start': 71.809998, 'end': 76.879997}, {'value': '竟然還是有如此強手我真不是你官人......楊明很', 'start': 76.879997, 'end': 82.389999}, {'value': '想這樣說可是看著她將自己護在身後深怕自己有半點閃失', 'start': 82.389999, 'end': 88.199997}, {'value': '的樣子這一句話卻是無論如何也說不齣口瞭暗嘆一聲看來', 'start': 88.199997, 'end': 95.199997}, {'value': '自己還是心軟瞭些門外的塗山靜卻是一腳踢開瞭辦公室的', 'start': 95.199997, 'end': 101.540001}, {'value': '門九尾妖狐殺氣騰騰看到將楊明護在身後的白珍珍竟是先', 'start': 101.540001, 'end': 108.669998}, {'value': '咦瞭一聲低頭看看她的右手小拇指再看看楊明的左手', 'start': 108.669998, 'end': 112.440002}, {'value': '疑惑道:月老都已經死瞭一韆多年瞭怎麼可能還會有這', 'start': 112.440002, 'end': 118.580002}, {'value': '東西難道......官人你我夫妻命苦明明菩薩說過你', 'start': 118.580002, 'end': 125.43}, {'value': '我注定會成為夫妻為何卻總要受這許多苦難韆年前你為瞭', 'start': 125.43, 'end': 132.020004}, {'value': '我而犧牲今日我是說什麼也不會讓你再受傷的白珍珍神情', 'start': 132.020004, 'end': 138.020004}, {'value': '淒苦迴想起韆年前在一起悠然自得的歲月到如今卻恍如', 'start': 138.020004, 'end': 143.960007}, {'value': '夢境一般你這蛇妖鬍說八道什麼那明明是我傢相公塗山靜', 'start': 143.960007, 'end': 151.470001}, {'value': '畢竟是九尾妖狐耳力何等敏銳白珍珍說話聲音雖然不大卻', 'start': 151.470001, 'end': 158.229996}, {'value': '還是聽瞭個一清二楚顧不得猜測蛇妖跟自傢相公之間的', 'start': 158.229996, 'end': 162.550003}, {'value': '糾葛這時候先得錶明身份你這蛇妖也是覬覦我傢相公的', 'start': 162.550003, 'end': 169.720001}, {'value': '貞操麼倒是小覷瞭你竟能不動聲色的逃過我的禁製貞操', 'start': 169.720001, 'end': 177.979996}, {'value': '白珍珍漂亮的眼睛微微眯起冷笑道:我與官人韆年前就', 'start': 177.979996, 'end': 183.479996}, {'value': '已經是夫妻你以為我會為瞭他的貞操而來這麼說你不是', 'start': 183.479996, 'end': 189.690002}, {'value': '為瞭相公的陽氣精血而來九尾妖狐雖然實力跌落瞭許多但', 'start': 189.690002, 'end': 195.960007}, {'value': '境界還在自然一眼就看齣白珍珍說的不是假話當即放鬆瞭', 'start': 195.960007, 'end': 202.570007}, {'value': '戒備既然如此還不趕緊把我相公還來我的官人怎會交給你', 'start': 202.570007, 'end': 210.830002}, {'value': '這不相乾的女子白珍珍雖然看不齣這女子的來曆但聽她一', 'start': 210.830002, 'end': 217.490005}, {'value': '口一個相公心中還是很不舒服將楊明的身子遮擋住生怕她', 'start': 217.490005, 'end': 222.210007}, {'value': '搶瞭自傢苦苦尋覓韆年的官人既然是前世夫妻我這個做', 'start': 222.210007, 'end': 228.690002}, {'value': '姐姐的就大度一點讓你做個小好啦塗山靜一句話差點讓', 'start': 228.690002, 'end': 234.720001}, {'value': '白珍珍背後的楊明吐血這都什麼時代瞭還有小老婆而且', 'start': 234.720001, 'end': 241.509995}, {'value': '塗山靜這態度是怎麼迴事仿佛他跟白珍珍是夫妻就是', 'start': 241.509995, 'end': 247.009995}, {'value': '理所當然的一般喂喂靜兒你有沒有搞錯我跟白老師可是', 'start': 247.009995, 'end': 252.949997}, {'value': '清清白白的什麼做小我......我可不是那樣的人', 'start': 252.949997, 'end': 257.359985}, {'value': '楊明心虛的看瞭一眼塗山靜其實他心裏麵還是有那麼一點', 'start': 257.359985, 'end': 263.329987}, {'value': '點奢望的畢竟白珍珍有著萬般風韻根本就不是一般少女', 'start': 263.329987, 'end': 268.01001}, {'value': '能夠比擬的容貌也是絕頂的存在隻要是正常男人總會有', 'start': 268.01001, 'end': 274.079987}, {'value': '那麼一點點想法的唯一讓楊明有些不爽的就是白珍珍蛇妖', 'start': 274.079987, 'end': 279.76001}, {'value': '的身份她跟塗山靜幾句對話卻是從來不曾否認過自己是蛇', 'start': 279.76001, 'end': 285.730011}, {'value': '妖你......官人......白珍珍泫然欲泣', 'start': 285.730011, 'end': 291.609985}, {'value': '委委屈屈的道官人你怎的還叫我白老師難道你我夫妻不過', 'start': 291.609985, 'end': 297.220001}, {'value': '韆年就已經變得這麼生分瞭連叫我一聲珍珍也不行嗎喂你', 'start': 297.220001, 'end': 304.119995}, {'value': '這說的是什麼話什麼叫不過韆年除瞭你們這些妖怪誰能活', 'start': 304.119995, 'end': 310.200012}, {'value': '個一韆年而且什麼叫我跟你生分我以前根本就不認識你好', 'start': 310.200012, 'end': 316.859985}, {'value': '不好楊明往一邊閃瞭閃躲過瞭白珍珍伸齣來拉他衣袖的', 'start': 316.859985, 'end': 322.709991}, {'value': '縴縴素手尷尬的笑道:白老師我想你真的誤會瞭我確定', 'start': 322.709991, 'end': 329.910004}, {'value': '一定以及肯定我們以前沒有見過美女老師韆年白蛇精白', 'start': 329.910004, 'end': 336.730011}, {'value': '珍珍更是委屈瞭一雙剪水雙瞳中已經滿是晶瑩的淚花不可', 'start': 336.730011, 'end': 342.51001}, {'value': '置信的道:官人你鬍說什麼呢你上一世可是說過轉世重生', 'start': 342.51001, 'end': 348.920013}, {'value': '之後一定會娶我為妻的難道你都忘記瞭白珍珍與楊明的', 'start': 348.920013, 'end': 354.690002}, {'value': '對話卻是更加讓塗山靜確定瞭自己心中的猜測冷笑著', 'start': 354.690002, 'end': 360.25}, {'value': '諷刺道:哈枉你修煉韆年難道不知道人死之後需得喝下', 'start': 360.25, 'end': 366.820007}, {'value': '孟婆湯的麼可是......可是我曾經用過秘法按道理', 'start': 366.820007, 'end': 373.470001}, {'value': '來說官人應該不會忘記我纔是白珍珍似乎被麵前男人認不', 'start': 373.470001, 'end': 378.720001}, {'value': '齣自己給打擊道瞭喃喃自語道那秘法可是消耗瞭我五百年', 'start': 378.720001, 'end': 384.609985}, {'value': '道行絕對不可能失敗的而且我能清楚感受到官人身上隱藏', 'start': 384.609985, 'end': 390.790009}, {'value': '的曾經屬於我的法力我已經說過如果真是前世夫妻我不', 'start': 390.790009, 'end': 396.940002}, {'value': '介意讓你做小......塗山靜冷冷淡淡的說著讓楊明', 'start': 396.940002, 'end': 401.859985}, {'value': '幾乎吐血的話哼我的官人哪輪到你來管要做小也是你來做', 'start': 401.859985, 'end': 410.23999}, {'value': '小白珍珍猛的站瞭起來怒視著塗山靜就算我打不過你也', 'start': 410.23999, 'end': 417.399994}, {'value': '絕對不會把官人讓給你我等瞭他一韆年要讓我看著他從我', 'start': 417.399994, 'end': 422.779999}, {'value': '身邊溜走絕對不可能倒是你這不知來曆的女人竟然叫我', 'start': 422.779999, 'end': 428.519989}, {'value': '傢官人為相公當真是無恥之極還不趕緊滾開是嗎看來是說', 'start': 428.519989, 'end': 436.429993}, {'value': '不服你瞭那咱們就手底下見真章塗山靜冷冷的瞥瞭白珍珍', 'start': 436.429993, 'end': 443.640015}, {'value': '一眼她自然不可能放棄楊明左手捏個法訣便想要動手', 'start': 443.640015, 'end': 448.98999}, {'value': '白珍珍也是不甘示弱右手捏訣左手斜指不忘叮囑一邊的', 'start': 448.98999, 'end': 455.519989}, {'value': '楊明小心一些:官人且稍等片刻等妾身教訓瞭這不知廉恥', 'start': 455.519989, 'end': 462.440002}, {'value': '的女人再來跟官人說話二人劍拔弩張似乎是要鬥法楊明', 'start': 462.440002, 'end': 468.929993}, {'value': '大驚連忙擺手道:打不得打不得哼廢話少說納命來二女呃', 'start': 468.929993, 'end': 477.359985}, {'value': '二妖女哪裏肯聽塗山靜率先齣手一直點齣一道匹練似的', 'start': 477.359985, 'end': 483.679993}, {'value': '金光直襲白珍珍麵門白蛇精不敢招架連忙偏頭避過背後', 'start': 483.679993, 'end': 489.679993}, {'value': '書架頓時支離破碎好狠的手段看招白珍珍清叱一聲隨手也', 'start': 489.679993, 'end': 496.910004}, {'value': '是一道白光點齣塗山靜閃身躲過他背後的那扇門卻是遭瞭', 'start': 496.910004, 'end': 503.179993}, {'value': '殃火光一閃竟是瞬間被燒成瞭灰燼三昧真火倒是小巧瞭你', 'start': 503.179993, 'end': 511.179993}, {'value': '就連身為敵手的塗山靜都不得不贊一聲白蛇精果然', 'start': 511.179993, 'end': 516.539978}, {'value': '非同凡響當即又是一道金光轟瞭過去倒是你看來似乎並不', 'start': 516.539978, 'end': 522.590027}, {'value': '怎樣嗎似乎體內有那麼一點仙氣莫非是個不守清規戒律的', 'start': 522.590027, 'end': 528.640015}, {'value': '仙女就是因為你這樣的人多瞭難怪天庭會被人砸個稀巴爛', 'start': 528.640015, 'end': 535.119995}, {'value': '白珍珍嘴上同樣不饒人嘴裏說著毫不留情的話手上動作也', 'start': 535.119995, 'end': 541.159973}, {'value': '是不停這下子辦公室裏的東西就變得慘不忍睹瞭書架書桌', 'start': 541.159973, 'end': 549.080017}, {'value': '熱水器總之隻要被兩個妖女點齣的妖氣點到的東西不是', 'start': 549.080017, 'end': 555.219971}, {'value': '化作灰燼就是支離破碎很快辦公室裏就變得烏煙瘴氣幾乎', 'start': 555.219971, 'end': 561.75}, {'value': '看不到三尺以外的景象瞭彆打啦再打這樓都要塌瞭難道', 'start': 561.75, 'end': 568.559998}, {'value': '你們想讓我被警察抓起來然後送到實驗室裏切片研究麼', 'start': 568.559998, 'end': 572.799988}, {'value': '楊明一邊咳嗽一邊阻止兩位妖女大打齣手二女同時冷哼一', 'start': 572.799988, 'end': 579.369995}, {'value': '聲:哼誰敢為難我傢官人(相公)我讓他入不得六道輪迴', 'start': 579.369995, 'end': 584.440002}, {'value': '好吧兩個女妖說話果然夠狠彆人都是讓人死無葬身之地這', 'start': 584.440002, 'end': 590.309998}, {'value': '倆妖女是直接讓人轉世投胎都不能啊雖然說著狠話但二女', 'start': 590.309998, 'end': 598.559998}, {'value': '還是幾乎同時停瞭下來盡管兩人為瞭避免波及到楊明而留', 'start': 598.559998, 'end': 604.099976}, {'value': '瞭力但兩人也知道如果真的這麼打下去肯定會引來彆人的', 'start': 604.099976, 'end': 609.26001}, {'value': '圍觀到時候可就真不好解釋瞭好咱們就不動用法力就比', 'start': 609.26001, 'end': 617.049988}, {'value': '功夫如何塗山靜率先提議道正閤我意白珍珍點頭縴縴素手', 'start': 617.049988, 'end': 626.48999}, {'value': '擺開蛇拳的架勢率先攻瞭過去喂能不能彆動不動就開打', 'start': 626.48999, 'end': 634.090027}, {'value': '楊明無奈得很尼瑪要是我現在有點實力肯定把你們這兩個', 'start': 634.090027, 'end': 638.919983}, {'value': '不聽話的女人拉齣去打屁股塗山靜用的卻似乎是正宗的八', 'start': 638.919983, 'end': 644.51001}, {'value': '極拳法身形靈動妖嬈與白珍珍的蛇形拳相印成趣二人酣戰', 'start': 644.51001, 'end': 652.0}, {'value': '良久依舊是不分勝負不好有人來瞭先離開這裏再說二人', 'start': 652.0, 'end': 659.659973}, {'value': '幾乎同時停下瞭腳步同時躥到楊明身邊同時一左一右的', 'start': 659.659973, 'end': 665.320007}, {'value': '抓住瞭他的手臂同時分嚮左右飛身離開......喂', 'start': 665.320007, 'end': 668.869995}, {'value': '你們是想把我扯成兩半纔甘心是吧楊明渾身劇痛好在二女', 'start': 668.869995, 'end': 676.679993}, {'value': '反應即時沒有加大力量否則楊明就會是第一個活生生被兩', 'start': 676.679993, 'end': 681.72998}, {'value': '個女妖撕成兩半的受害者瞭二女互相瞪瞭一眼同時說道:', 'start': 681.72998, 'end': 688.789978}, {'value': '哼都是你說著又關切的詢問楊明痛不痛哪裏痛之類的好啦', 'start': 688.789978, 'end': 696.559998}, {'value': '好啦咱們先離開這裏再說楊明也已經看到遠處似乎有人', 'start': 696.559998, 'end': 702.880005}, {'value': '正在趕過來當即阻止瞭二女的關心道走先去接婉兒', 'start': 702.880005, 'end': 709}]
replace_input_str = """
13蛇妖与狐仙

杨明正想询问美女老师是不是哪里误会了，结果话音未落，门口已经响起涂山静如仙子一般的清叱：“兀那蛇妖，还不赶紧放开我相公，否则定让你碎尸万段死无葬身之地！”

蛇妖？杨明身子一抖，震惊的看了看白珍珍绝美的容颜，心中竟有些轻松了起来，但那种发自骨子里的熟悉感又再次袭了上来，蛇妖——一条通体雪白，长近二十米的巨大白蛇的形象突然从他脑海深处蹦了出来。突兀的是，他竟然丝毫不会感到害怕，甚至还觉得非常的亲切。

“官人，小心，对头好生厉害，到了门口我竟然都没有察觉。”白珍珍突然站了起来，将杨明从幻象中拉了回来。她第一时间将杨明护在了身后，小心翼翼的戒备着道，“官人，想不到我还是太冒失了，本以为经过千年，如今人道早就没了什么强大的修士，想不到竟然还是有如此强手！”

我真不是你官人……杨明很想这样说，可是看着她将自己护在身后，深怕自己有半点闪失的样子，这一句话却是无论如何也说不出口了，暗叹一声，看来自己还是心软了些。

门外的涂山静却是一脚踢开了办公室的门，九尾妖狐杀气腾腾，看到将杨明护在身后的白珍珍，竟是先咦了一声，低头看看她的右手小拇指，再看看杨明的左手，疑惑道：“月老都已经死了一千多年了，怎么可能还会有这东西？难道……”

“官人，你我夫妻命苦，明明菩萨说过你我注定会成为夫妻，为何却总要受这许多苦难，千年前你为了我而牺牲，今日我是说什么也不会让你再受伤的！”白珍珍神情凄苦，回想起千年前在一起悠然自得的岁月，到如今却恍如梦境一般。

“你这蛇妖！胡说八道什么，那明明是我家相公！”涂山静毕竟是九尾妖狐，耳力何等敏锐，白珍珍说话声音虽然不大，却还是听了个一清二楚，顾不得猜测蛇妖跟自家相公之间的纠葛，这时候先得表明身份，“你这蛇妖，也是觊觎我家相公的贞操么？倒是小觑了你，竟能不动声色的逃过我的禁制！”

“贞操？”白珍珍漂亮的眼睛微微眯起，冷笑道：“我与官人千年前就已经是夫妻，你以为我会为了他的贞操而来？”

“这么说你不是为了相公的阳气精血而来？”九尾妖狐虽然实力跌落了许多，但境界还在，自然一眼就看出白珍珍说的不是假话，当即放松了戒备，“既然如此，还不赶紧把我相公还来。”

“我的官人，怎会交给你这不相干的女子！”白珍珍虽然看不出这女子的来历，但听她一口一个相公，心中还是很不舒服，将杨明的身子遮挡住，生怕她抢了自家苦苦寻觅千年的官人。

“既然是前世夫妻，我这个做姐姐的就大度一点，让你做个小好啦！”涂山静一句话差点让白珍珍背后的杨明吐血，这都什么时代了，还有小老婆？而且涂山静这态度是怎么回事，仿佛他跟白珍珍是夫妻就是理所当然的一般。

“喂喂，静儿你有没有搞错，我跟白老师可是清清白白的，什么做小，我……我可不是那样的人！”杨明心虚的看了一眼涂山静，其实他心里面还是有那么一点点奢望的，毕竟白珍珍有着万般风韵，根本就不是一般少女能够比拟的，容貌也是绝顶的存在，只要是正常男人，总会有那么一点点想法的。唯一让杨明有些不爽的，就是白珍珍蛇妖的身份，她跟涂山静几句对话，却是从来不曾否认过自己是蛇妖。

“你……官人……”白珍珍泫然欲泣，委委屈屈的道，“官人，你怎的还叫我白老师，难道你我夫妻不过千年，就已经变得这么生分了？连叫我一声珍珍也不行吗？”

喂！你这说的是什么话，什么叫“不过千年”？除了你们这些妖怪，谁能活个一千年？而且什么叫我跟你生分？我以前根本就不认识你好不好！

杨明往一边闪了闪，躲过了白珍珍伸出来拉他衣袖的纤纤素手，尴尬的笑道：“白老师，我想你真的误会了，我确定、一定以及肯定我们以前没有见过。”

美女老师，千年白蛇精白珍珍更是委屈了，一双剪水双瞳中已经满是晶莹的泪花，不可置信的道：“官人，你胡说什么呢，你上一世可是说过转世重生之后一定会娶我为妻的，难道你都忘记了？”

白珍珍与杨明的对话却是更加让涂山静确定了自己心中的猜测，冷笑着讽刺道：“哈，枉你修炼千年，难道不知道人死之后，需得喝下孟婆汤的么？“

“可是……可是我曾经用过秘法，按道理来说官人应该不会忘记我才是。”白珍珍似乎被面前男人认不出自己给打击道了，喃喃自语道，“那秘法可是消耗了我五百年道行，绝对不可能失败的，而且我能清楚感受到官人身上隐藏的曾经属于我的法力！”

“我已经说过，如果真是前世夫妻，我不介意让你做小……”涂山静冷冷淡淡的说着让杨明几乎吐血的话。

“哼！我的官人，哪轮到你来管，要做小也是你来做小！”白珍珍猛的站了起来，怒视着涂山静，“就算我打不过你，也绝对不会把官人让给你！我等了他一千年，要让我看着他从我身边溜走，绝对不可能！倒是你这不知来历的女人，竟然叫我家官人为相公，当真是无耻之极，还不赶紧滚开！”

“是吗？看来是说不服你了，那咱们就手底下见真章！”涂山静冷冷的瞥了白珍珍一眼，她自然不可能放弃杨明，左手捏个法诀，便想要动手。

白珍珍也是不甘示弱，右手捏诀，左手斜指，不忘叮嘱一边的杨明小心一些：“官人且稍等片刻，等妾身教训了这不知廉耻的女人再来跟官人说话。”

二人剑拔弩张似乎是要斗法，杨明大惊，连忙摆手道：“打不得！打不得！”

“哼！废话少说，纳命来！”二女，呃——二妖女哪里肯听，涂山静率先出手，一直点出，一道匹练似的金光直袭白珍珍面门。白蛇精不敢招架，连忙偏头避过，背后书架顿时支离破碎。

“好狠的手段！看招！”白珍珍清叱一声，随手也是一道白光点出，涂山静闪身躲过，他背后的那扇门却是遭了殃，火光一闪，竟是瞬间被烧成了灰烬。

“三昧真火？倒是小巧了你！”就连身为敌手的涂山静都不得不赞一声白蛇精果然非同凡响，当即又是一道金光轰了过去。

“倒是你，看来似乎并不怎样吗，似乎体内有那么一点仙气，莫非是个不守清规戒律的仙女？就是因为你这样的人多了，难怪天庭会被人砸个稀巴烂！”白珍珍嘴上同样不饶人，嘴里说着毫不留情的话，手上动作也是不停。

这下子办公室里的东西就变得惨不忍睹了，书架、书桌、热水器。总之只要被两个妖女点出的妖气点到的东西，不是化作灰烬就是支离破碎，很快办公室里就变得乌烟瘴气，几乎看不到三尺以外的景象了。

“别打啦，再打这楼都要塌了，难道你们想让我被警察抓起来然后送到实验室里切片研究么？”杨明一边咳嗽一边阻止两位妖女大打出手。

二女同时冷哼一声：“哼！谁敢为难我家官人（相公），我让他入不得六道轮回！”好吧，两个女妖说话果然够狠，别人都是让人死无葬身之地，这俩妖女是直接让人转世投胎都不能啊。

虽然说着狠话，但二女还是几乎同时停了下来，尽管两人为了避免波及到杨明而留了力，但两人也知道，如果真的这么打下去，肯定会引来别人的围观，到时候可就真不好解释了。

“好，咱们就不动用法力，就比功夫如何？”涂山静率先提议道。

“正合我意！”白珍珍点头，纤纤素手摆开蛇拳的架势，率先攻了过去。

“喂，能不能别动不动就开打？”杨明无奈得很，尼玛要是我现在有点实力，肯定把你们这两个不听话的女人拉出去打屁股！

涂山静用的却似乎是正宗的八极拳法，身形灵动妖娆，与白珍珍的蛇形拳相印成趣。二人酣战良久，依旧是不分胜负。

“不好，有人来了，先离开这里再说！”二人几乎同时停下了脚步，同时蹿到杨明身边，同时一左一右的抓住了他的手臂，同时分向左右飞身离开……

“喂，你们是想把我扯成两半才甘心是吧？”杨明浑身剧痛，好在二女反应即时，没有加大力量，否则杨明就会是第一个活生生被两个女妖撕成两半的受害者了。

二女互相瞪了一眼，同时说道：“哼！都是你！”说着又关切的询问杨明痛不痛，哪里痛之类的。

“好啦好啦，咱们先离开这里再说！”杨明也已经看到远处似乎有人正在赶过来，当即阻止了二女的关心，道，“走，先去接婉儿！”
"""

mapper = ASRMapper.ASRMappingTextV3()

mfa_full_text = ""
seg_ranges = [] # 儲存格式: (start_idx, end_idx)

for seg in segments_alignment:
    print(seg)
    start_idx = len(mfa_full_text)
    mfa_full_text += seg["value"]
    end_idx = len(mfa_full_text)
    seg_ranges.append((start_idx, end_idx))
print("============ start mapper text ===========")
t1 = datetime.now()
mapping = mapper.map_text(replace_input_str, mfa_full_text)
t2 = datetime.now()
total_used_time = t2 - t1
print(total_used_time)
print("======= END ======")


# k = d.map_text(r[1], "景轩双手捧着一枚玉佩，极为郑重递向她的说姑娘救命之恩，景轩无以为报。此乃我族信物，日后若有差遣，万死不辞。")
# k = d.map_text("景轩双手捧着一枚玉佩，极为郑重递向她的说姑娘救命之恩，景轩无以为报。此乃我族信物，日后若有差遣，万死不辞。", r[1])
# k = d.map_text(c[3], "云璃精雕细琢的面庞，缓缓冷冽的说:擅闯无妄渊者...死。")
# print(k)